Extensions/src/Documents/ПринятиеКУчетуВА/ПринятиеКУчетуВА.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПринятиеКУчетуВА</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Сумма</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Ячейка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Количество</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>СтруктурнаяЕдиница</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Партия</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Проект</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ЕдиницаИзмерения</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>ВнеоборотныеАктивы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>СрокИспользованияДляВычисленияАмортизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>4</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ЛиквидационнаяСтоимостьДляУменьшенногоОстатка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>СчетЗатрат</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачальнаяСтоимость</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>ВнеоборотныйАктив</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СтруктурнаяЕдиница</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОбъемПродукцииРаботДляВычисленияАмортизации</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Адрес</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачислятьАмортизацию</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НачислятьАмортизациюВТекущемМесяце</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>СчетЗатратРегл</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>НаправлениеДеятельности</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ГодовойПроцентАмортизацииДляУменьшенногоОстатка</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>2</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

Extensions/src/Documents/ПринятиеКУчетуВА/ManagerModule.bsl
&После("ИнициализироватьДанныеДокумента")
Процедура РасшAzRy_ИнициализироватьДанныеДокумента(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаПринятиеКУчетуВА.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Ссылка", ДокументСсылкаПринятиеКУчетуВА);
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	Запрос.УстановитьПараметр("ИспользоватьХарактеристики", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьХарактеристики);
	Запрос.УстановитьПараметр("УчетПоЯчейкам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоЯчейкам);
	Запрос.УстановитьПараметр("ИспользоватьПартии", СтруктураДополнительныеСвойства.УчетнаяПолитика.ИспользоватьПартии);
	
	//ПодольскийАИ #УчетПроектов 29.07.2021 {
	Запрос.УстановитьПараметр("УчетПоПроектам", СтруктураДополнительныеСвойства.УчетнаяПолитика.УчетПоПроектам);
	//ПодольскийАИ #УчетПроектов 29.07.2021 }
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	1 КАК НомерСтроки,
	|	ЗНАЧЕНИЕ(ВидДвиженияНакопления.Расход) КАК ВидДвижения,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.СтруктурнаяЕдиница.ОрдерныйСклад КАК ОрдерныйСклад,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.Ячейка КАК Ячейка,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗапасов КАК СчетУчета,
	|	ТаблицаДокумента.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.Номенклатура КАК Номенклатура,
	|	ВЫБОР
	|		КОГДА &ИспользоватьХарактеристики
	|			ТОГДА ТаблицаДокумента.Характеристика
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ХарактеристикиНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Характеристика,
	//ПодольскийАИ #УчетПроектов 29.07.2021 {
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам И ТаблицаДокумента.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Проект
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект,
	//ПодольскийАИ #УчетПроектов 29.07.2021 }
	|	ВЫБОР
	|		КОГДА &ИспользоватьПартии
	|			ТОГДА ТаблицаДокумента.Партия
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.ПартииНоменклатуры.ПустаяСсылка)
	|	КОНЕЦ КАК Партия,
	|	ВЫБОР
	|		КОГДА ТИПЗНАЧЕНИЯ(ТаблицаДокумента.ЕдиницаИзмерения) = ТИП(Справочник.КлассификаторЕдиницИзмерения)
	|			ТОГДА ТаблицаДокумента.Количество
	|		ИНАЧЕ ТаблицаДокумента.Количество * ТаблицаДокумента.ЕдиницаИзмерения.Коэффициент
	|	КОНЕЦ КАК Количество,
	|	ТаблицаДокумента.Сумма КАК Сумма,
	|	ЗНАЧЕНИЕ(ВидДвиженияБухгалтерии.Кредит) КАК ВидДвиженияУправленческий
	|ПОМЕСТИТЬ ВременнаяТаблицаЗапасы
	|ИЗ
	|	Документ.ПринятиеКУчетуВА КАК ТаблицаДокумента
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	МАКСИМУМ(ПринятиеКУчетуВАВнеоборотныеАктивы.НомерСтроки) КАК НомерСтроки
	|ПОМЕСТИТЬ ВТ_МаксКоличествоВА
	|ИЗ
	|	Документ.ПринятиеКУчетуВА.ВнеоборотныеАктивы КАК ПринятиеКУчетуВАВнеоборотныеАктивы
	|ГДЕ	
	|	ПринятиеКУчетуВАВнеоборотныеАктивы.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Ссылка.Дата КАК Дата,
	|	&Организация КАК Организация,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	ТаблицаДокумента.НачальнаяСтоимость КАК ПервоначальнаяСтоимость,
	|	ТаблицаДокумента.ВнеоборотныйАктив.СчетУчета КАК СчетУчета,
	|	ТаблицаДокумента.ВнеоборотныйАктив.СчетУчетаРегл КАК СчетУчетаРегл,
	|	ТаблицаДокумента.СтруктурнаяЕдиница КАК СтруктурнаяЕдиница,
	|	ТаблицаДокумента.ОбъемПродукцииРаботДляВычисленияАмортизации КАК ОбъемПродукцииРаботДляВычисленияАмортизации,
	|	ТаблицаДокумента.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце,
	|	ТаблицаДокумента.СрокИспользованияДляВычисленияАмортизации КАК СрокИспользованияДляВычисленияАмортизации,
	|	ТаблицаДокумента.СчетЗатрат КАК СчетЗатрат,
	|	ТаблицаДокумента.Адрес КАК Адрес,
	|	ТаблицаДокумента.СчетЗатратРегл КАК СчетЗатратРегл,
	|	ТаблицаДокумента.НаправлениеДеятельности КАК НаправлениеДеятельности,
	|	ТаблицаДокумента.Ссылка.Номенклатура.СчетУчетаЗапасов КАК СчетУчетаЗапасов,
	|	ТаблицаДокумента.Ссылка.Номенклатура.СчетУчетаЗапасовРегл КАК СчетУчетаЗапасовРегл,
	|	ТаблицаДокумента.Ссылка.Номенклатура КАК Номенклатура,
	|	ТаблицаДокумента.Ссылка.СтруктурнаяЕдиница КАК Склад,
	|	ТаблицаДокумента.Ссылка.Характеристика,
	//ПодольскийАИ #УчетПроектов 29.07.2021 {
	|	ВЫБОР
	|		КОГДА &УчетПоПроектам И ТаблицаДокумента.Ссылка.Проект <> Значение(Справочник.Проекты.ПустаяСсылка)
	|			ТОГДА ТаблицаДокумента.Ссылка.Проект
	|		ИНАЧЕ ЗНАЧЕНИЕ(Справочник.Проекты.БезПроекта)
	|	КОНЕЦ КАК Проект,
	//ПодольскийАИ #УчетПроектов 29.07.2021 }
	|	ВЫБОР
	|		КОГДА ТаблицаДокумента.НомерСтроки = ВТ_МаксКоличествоВА.НомерСтроки
	|			ТОГДА (ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Количество / ВТ_МаксКоличествоВА.НомерСтроки КАК ЧИСЛО(15, 3))) + (ТаблицаДокумента.Ссылка.Количество - (ВЫРАЗИТЬ((ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Количество / ВТ_МаксКоличествоВА.НомерСтроки КАК ЧИСЛО(15, 3))) * ВТ_МаксКоличествоВА.НомерСтроки КАК ЧИСЛО(15, 3))))
	|		ИНАЧЕ ВЫРАЗИТЬ(ТаблицаДокумента.Ссылка.Количество / ВТ_МаксКоличествоВА.НомерСтроки КАК ЧИСЛО(15, 3))
	|	КОНЕЦ КАК Количество,
	|	ВТ_МаксКоличествоВА.НомерСтроки КАК МаксНомерСтроки,
	|	ТаблицаДокумента.ГодовойПроцентАмортизацииДляУменьшенногоОстатка КАК ГодовойПроцентАмортизацииДляУменьшенногоОстатка,
	|	ТаблицаДокумента.ЛиквидационнаяСтоимостьДляУменьшенногоОстатка КАК ЛиквидационнаяСтоимостьДляУменьшенногоОстатка
	// +++ { AzRy - [12.10.2021] - Jira:ERPM-863 - Developer: George Mamulashvili
	|	,ТаблицаДокумента.ВнеоборотныйАктив.СпособАмортизации КАК AzRyСпособАмортизации,
	|	ИСТИНА КАК AzRyИзменениеСпособаМетодаАмортизаций
	// +++ } AzRy - [12.10.2021] - Jira:ERPM-863 - Developer: George Mamulashvili
	|ПОМЕСТИТЬ ВременнаяТаблицаВнеоборотныеАктивы
	|ИЗ
	|	Документ.ПринятиеКУчетуВА.ВнеоборотныеАктивы КАК ТаблицаДокумента,
	|	ВТ_МаксКоличествоВА КАК ВТ_МаксКоличествоВА
	|ГДЕ
	|	ТаблицаДокумента.Ссылка = &Ссылка";
	
	Запрос.ВыполнитьПакет();
	
	// Формирование таблиц движений по разделам учета.
	СформироватьТаблицаСостоянияВнеоборотныхАктивов(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаПараметрыВнеоборотныхАктивов(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаВнеоборотныеАктивы(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасы(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыНаСкладах(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаЗапасыКРасходуСоСкладов(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства);
	СформироватьТаблицаУправленческий(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства);
	ИнтеграцияСНалоговойСлужбой_И_БухгалтерскийУчет.СформироватьТаблицаХозрасчетный_ПринятиеКУчетуВА(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства); //+++
			
КонецПроцедуры

&После("СформироватьТаблицаСостоянияВнеоборотныхАктивов")
Процедура РасшAzRy_СформироватьТаблицаСостоянияВнеоборотныхАктивов(ДокументСсылкаПринятиеКУчетуВА, СтруктураДополнительныеСвойства)
	
	Если Не ДокументСсылкаПринятиеКУчетуВА.AzRyДокументЗагруженИзДругойБазыРедактированиеЗапрешено Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.МенеджерВременныхТаблиц = СтруктураДополнительныеСвойства.ДляПроведения.СтруктураВременныеТаблицы.МенеджерВременныхТаблиц;
	
	Запрос.УстановитьПараметр("Организация", СтруктураДополнительныеСвойства.ДляПроведения.Организация);
	
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ТаблицаДокумента.НомерСтроки КАК НомерСтроки,
	|	ТаблицаДокумента.Дата КАК Период,
	|	ТаблицаДокумента.ВнеоборотныйАктив КАК ВнеоборотныйАктив,
	|	&Организация КАК Организация,
	|	ЗНАЧЕНИЕ(Перечисление.СостоянияВнеоборотныхАктивов.ПринятКУчету) КАК Состояние,
	|	ТаблицаДокумента.НачислятьАмортизацию КАК НачислятьАмортизацию,
	|	ТаблицаДокумента.НачислятьАмортизациюВТекущемМесяце КАК НачислятьАмортизациюВТекущемМесяце
	// +++ { AzRy - [12.10.2021] - Jira:ERPM-863 - Developer: George Mamulashvili - Comment:
	|	,
	|	ТаблицаДокумента.AzRyСпособАмортизации,
	|	ТаблицаДокумента.AzRyИзменениеСпособаМетодаАмортизаций
	// +++ } AzRy - [12.10.2021] - Jira:ERPM-863 - Developer: George Mamulashvili - Comment:	
	|ИЗ
	|	ВременнаяТаблицаВнеоборотныеАктивы КАК ТаблицаДокумента
	|
	|УПОРЯДОЧИТЬ ПО
	|	НомерСтроки";
	
	РезультатЗапроса = Запрос.Выполнить();
	
	СтруктураДополнительныеСвойства.ТаблицыДляДвижений.Вставить("ТаблицаСостоянияВнеоборотныхАктивов", РезультатЗапроса.Выгрузить());
	
КонецПроцедуры
